noobwang233/hal_gigadevice/include/dt-bindings/pinctrl/gd32e503z(e-c)xx-pinctrl.h
/* CK_OUT */
#define CK_OUT_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* CMP1_IM4 */
#define CMP1_IM4_PA4 \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, NORMP)

/* CMP1_IM5 */
#define CMP1_IM5_PA5 \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, NORMP)

/* CMP1_IM6 */
#define CMP1_IM6_PA2 \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, NORMP)

/* CMP1_IP */
#define CMP1_IP_PA7 \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, NORMP)

/* CMP1_OUT */
#define CMP1_OUT_PA2 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)
#define CMP1_OUT_PA12 \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)
#define CMP1_OUT_PB9 \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, NORMP)
#define CMP1_OUT_PE8 \
	GD32_PINMUX_AFIO('E', 8, ALTERNATE, NORMP)
#define CMP1_OUT_PE13 \
	GD32_PINMUX_AFIO('E', 13, ALTERNATE, NORMP)

/* CMP3_IM4 */
#define CMP3_IM4_PA4 \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, NORMP)

/* CMP3_IM5 */
#define CMP3_IM5_PA5 \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, NORMP)

/* CMP3_IM7 */
#define CMP3_IM7_PB2 \
	GD32_PINMUX_AFIO('B', 2, GPIO_IN, NORMP)

/* CMP3_IP */
#define CMP3_IP_PB0 \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, NORMP)

/* CMP3_OUT */
#define CMP3_OUT_PB1 \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, NORMP)
#define CMP3_OUT_PE9 \
	GD32_PINMUX_AFIO('E', 9, ALTERNATE, NORMP)
#define CMP3_OUT_PE12 \
	GD32_PINMUX_AFIO('E', 12, ALTERNATE, NORMP)

/* CMP5_IM4 */
#define CMP5_IM4_PA4 \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, NORMP)

/* CMP5_IM5 */
#define CMP5_IM5_PA5 \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, NORMP)

/* CMP5_IM7 */
#define CMP5_IM7_PB15 \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)

/* CMP5_IP */
#define CMP5_IP_PB11 \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, NORMP)

/* CMP5_OUT */
#define CMP5_OUT_PA10 \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)
#define CMP5_OUT_PC6 \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)
#define CMP5_OUT_PE10 \
	GD32_PINMUX_AFIO('E', 10, ALTERNATE, NORMP)
#define CMP5_OUT_PE11 \
	GD32_PINMUX_AFIO('E', 11, ALTERNATE, NORMP)

/* CTC_SYNC */
#define CTC_SYNC_PA8_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, CTC_NORMP)
#define CTC_SYNC_PD15_PRMP \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, CTC_PRMP)
#define CTC_SYNC_PF0_FRMP \
	GD32_PINMUX_AFIO('F', 0, ALTERNATE, CTC_FRMP)

/* DAC_OUT0 */
#define DAC_OUT0_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* DAC_OUT1 */
#define DAC_OUT1_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* EXMC_A0 */
#define EXMC_A0_PF0 \
	GD32_PINMUX_AFIO('F', 0, ALTERNATE, NORMP)

/* EXMC_A1 */
#define EXMC_A1_PF1 \
	GD32_PINMUX_AFIO('F', 1, ALTERNATE, NORMP)

/* EXMC_A10 */
#define EXMC_A10_PG0 \
	GD32_PINMUX_AFIO('G', 0, ALTERNATE, NORMP)

/* EXMC_A11 */
#define EXMC_A11_PG1 \
	GD32_PINMUX_AFIO('G', 1, ALTERNATE, NORMP)

/* EXMC_A12 */
#define EXMC_A12_PG2 \
	GD32_PINMUX_AFIO('G', 2, ALTERNATE, NORMP)

/* EXMC_A13 */
#define EXMC_A13_PG3 \
	GD32_PINMUX_AFIO('G', 3, ALTERNATE, NORMP)

/* EXMC_A14 */
#define EXMC_A14_PG4 \
	GD32_PINMUX_AFIO('G', 4, ALTERNATE, NORMP)

/* EXMC_A15 */
#define EXMC_A15_PG5 \
	GD32_PINMUX_AFIO('G', 5, ALTERNATE, NORMP)

/* EXMC_A16 */
#define EXMC_A16_PD11 \
	GD32_PINMUX_AFIO('D', 11, ALTERNATE, NORMP)

/* EXMC_A17 */
#define EXMC_A17_PD12 \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, NORMP)

/* EXMC_A18 */
#define EXMC_A18_PD13 \
	GD32_PINMUX_AFIO('D', 13, ALTERNATE, NORMP)

/* EXMC_A19 */
#define EXMC_A19_PE3 \
	GD32_PINMUX_AFIO('E', 3, ALTERNATE, NORMP)

/* EXMC_A2 */
#define EXMC_A2_PF2 \
	GD32_PINMUX_AFIO('F', 2, ALTERNATE, NORMP)

/* EXMC_A20 */
#define EXMC_A20_PE4 \
	GD32_PINMUX_AFIO('E', 4, ALTERNATE, NORMP)

/* EXMC_A21 */
#define EXMC_A21_PE5 \
	GD32_PINMUX_AFIO('E', 5, ALTERNATE, NORMP)

/* EXMC_A22 */
#define EXMC_A22_PE6 \
	GD32_PINMUX_AFIO('E', 6, ALTERNATE, NORMP)

/* EXMC_A23 */
#define EXMC_A23_PE2 \
	GD32_PINMUX_AFIO('E', 2, ALTERNATE, NORMP)

/* EXMC_A24 */
#define EXMC_A24_PG13 \
	GD32_PINMUX_AFIO('G', 13, ALTERNATE, NORMP)

/* EXMC_A25 */
#define EXMC_A25_PG14 \
	GD32_PINMUX_AFIO('G', 14, ALTERNATE, NORMP)

/* EXMC_A3 */
#define EXMC_A3_PF3 \
	GD32_PINMUX_AFIO('F', 3, ALTERNATE, NORMP)

/* EXMC_A4 */
#define EXMC_A4_PF4 \
	GD32_PINMUX_AFIO('F', 4, ALTERNATE, NORMP)

/* EXMC_A5 */
#define EXMC_A5_PF5 \
	GD32_PINMUX_AFIO('F', 5, ALTERNATE, NORMP)

/* EXMC_A6 */
#define EXMC_A6_PF12 \
	GD32_PINMUX_AFIO('F', 12, ALTERNATE, NORMP)

/* EXMC_A7 */
#define EXMC_A7_PF13 \
	GD32_PINMUX_AFIO('F', 13, ALTERNATE, NORMP)

/* EXMC_A8 */
#define EXMC_A8_PF14 \
	GD32_PINMUX_AFIO('F', 14, ALTERNATE, NORMP)

/* EXMC_A9 */
#define EXMC_A9_PF15 \
	GD32_PINMUX_AFIO('F', 15, ALTERNATE, NORMP)

/* EXMC_CD */
#define EXMC_CD_PF9 \
	GD32_PINMUX_AFIO('F', 9, GPIO_IN, NORMP)

/* EXMC_CLK */
#define EXMC_CLK_PD3 \
	GD32_PINMUX_AFIO('D', 3, ALTERNATE, NORMP)

/* EXMC_D0 */
#define EXMC_D0_PD14 \
	GD32_PINMUX_AFIO('D', 14, ALTERNATE, NORMP)

/* EXMC_D1 */
#define EXMC_D1_PD15 \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, NORMP)

/* EXMC_D10 */
#define EXMC_D10_PE13 \
	GD32_PINMUX_AFIO('E', 13, ALTERNATE, NORMP)

/* EXMC_D11 */
#define EXMC_D11_PE14 \
	GD32_PINMUX_AFIO('E', 14, ALTERNATE, NORMP)

/* EXMC_D12 */
#define EXMC_D12_PE15 \
	GD32_PINMUX_AFIO('E', 15, ALTERNATE, NORMP)

/* EXMC_D13 */
#define EXMC_D13_PD8 \
	GD32_PINMUX_AFIO('D', 8, ALTERNATE, NORMP)

/* EXMC_D14 */
#define EXMC_D14_PD9 \
	GD32_PINMUX_AFIO('D', 9, ALTERNATE, NORMP)

/* EXMC_D15 */
#define EXMC_D15_PD10 \
	GD32_PINMUX_AFIO('D', 10, ALTERNATE, NORMP)

/* EXMC_D2 */
#define EXMC_D2_PD0 \
	GD32_PINMUX_AFIO('D', 0, ALTERNATE, NORMP)

/* EXMC_D3 */
#define EXMC_D3_PD1 \
	GD32_PINMUX_AFIO('D', 1, ALTERNATE, NORMP)

/* EXMC_D4 */
#define EXMC_D4_PE7 \
	GD32_PINMUX_AFIO('E', 7, ALTERNATE, NORMP)

/* EXMC_D5 */
#define EXMC_D5_PE8 \
	GD32_PINMUX_AFIO('E', 8, ALTERNATE, NORMP)

/* EXMC_D6 */
#define EXMC_D6_PE9 \
	GD32_PINMUX_AFIO('E', 9, ALTERNATE, NORMP)

/* EXMC_D7 */
#define EXMC_D7_PE10 \
	GD32_PINMUX_AFIO('E', 10, ALTERNATE, NORMP)

/* EXMC_D8 */
#define EXMC_D8_PE11 \
	GD32_PINMUX_AFIO('E', 11, ALTERNATE, NORMP)

/* EXMC_D9 */
#define EXMC_D9_PE12 \
	GD32_PINMUX_AFIO('E', 12, ALTERNATE, NORMP)

/* EXMC_INT1 */
#define EXMC_INT1_PG6 \
	GD32_PINMUX_AFIO('G', 6, GPIO_IN, NORMP)

/* EXMC_INT2 */
#define EXMC_INT2_PG7 \
	GD32_PINMUX_AFIO('G', 7, GPIO_IN, NORMP)

/* EXMC_INTR */
#define EXMC_INTR_PF10 \
	GD32_PINMUX_AFIO('F', 10, GPIO_IN, NORMP)

