noobwang233/hal_gigadevice/include/dt-bindings/pinctrl/gd32e503z(e-c)xx-pinctrl.h
/* EXMC_NADV */
#define EXMC_NADV_PB7 \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, NORMP)

/* EXMC_NBL0 */
#define EXMC_NBL0_PE0 \
	GD32_PINMUX_AFIO('E', 0, ALTERNATE, NORMP)

/* EXMC_NBL1 */
#define EXMC_NBL1_PE1 \
	GD32_PINMUX_AFIO('E', 1, ALTERNATE, NORMP)

/* EXMC_NCE1 */
#define EXMC_NCE1_PD7 \
	GD32_PINMUX_AFIO('D', 7, ALTERNATE, NORMP)

/* EXMC_NCE2 */
#define EXMC_NCE2_PG9 \
	GD32_PINMUX_AFIO('G', 9, ALTERNATE, NORMP)

/* EXMC_NCE3_0 */
#define EXMC_NCE3_0_PG10 \
	GD32_PINMUX_AFIO('G', 10, ALTERNATE, NORMP)

/* EXMC_NCE3_1 */
#define EXMC_NCE3_1_PG11 \
	GD32_PINMUX_AFIO('G', 11, ALTERNATE, NORMP)

/* EXMC_NE0 */
#define EXMC_NE0_PD7 \
	GD32_PINMUX_AFIO('D', 7, ALTERNATE, NORMP)

/* EXMC_NE1 */
#define EXMC_NE1_PG9 \
	GD32_PINMUX_AFIO('G', 9, ALTERNATE, NORMP)

/* EXMC_NE2 */
#define EXMC_NE2_PG10 \
	GD32_PINMUX_AFIO('G', 10, ALTERNATE, NORMP)

/* EXMC_NE3 */
#define EXMC_NE3_PG12 \
	GD32_PINMUX_AFIO('G', 12, ALTERNATE, NORMP)

/* EXMC_NIORD */
#define EXMC_NIORD_PF6 \
	GD32_PINMUX_AFIO('F', 6, ALTERNATE, NORMP)

/* EXMC_NIOS16 */
#define EXMC_NIOS16_PF11 \
	GD32_PINMUX_AFIO('F', 11, GPIO_IN, NORMP)

/* EXMC_NIOWR */
#define EXMC_NIOWR_PF8 \
	GD32_PINMUX_AFIO('F', 8, ALTERNATE, NORMP)

/* EXMC_NOE */
#define EXMC_NOE_PD4 \
	GD32_PINMUX_AFIO('D', 4, ALTERNATE, NORMP)

/* EXMC_NREG */
#define EXMC_NREG_PF7 \
	GD32_PINMUX_AFIO('F', 7, ALTERNATE, NORMP)

/* EXMC_NWAIT */
#define EXMC_NWAIT_PD6 \
	GD32_PINMUX_AFIO('D', 6, GPIO_IN, NORMP)

/* EXMC_NWE */
#define EXMC_NWE_PD5 \
	GD32_PINMUX_AFIO('D', 5, ALTERNATE, NORMP)

/* I2C0_SCL */
#define I2C0_SCL_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, I2C0_NORMP)
#define I2C0_SCL_PB8_RMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, I2C0_RMP)

/* I2C0_SDA */
#define I2C0_SDA_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, I2C0_NORMP)
#define I2C0_SDA_PB9_RMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, I2C0_RMP)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* I2C0_TXFRAME */
#define I2C0_TXFRAME_PB4 \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)

/* I2C1_SCL */
#define I2C1_SCL_PB10 \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, NORMP)

/* I2C1_SDA */
#define I2C1_SDA_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* I2C1_SMBA */
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2C1_TXFRAME */
#define I2C1_TXFRAME_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* I2C2_SCL */
#define I2C2_SCL_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)
#define I2C2_SCL_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)
#define I2C2_SCL_PC10 \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, NORMP)

/* I2C2_SDA */
#define I2C2_SDA_PB4 \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)
#define I2C2_SDA_PB8 \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, NORMP)
#define I2C2_SDA_PC9 \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, NORMP)

/* I2C2_SMBA */
#define I2C2_SMBA_PA9 \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, NORMP)

/* I2S1_ADD_SD */
#define I2S1_ADD_SD_PB14_INP \
	GD32_PINMUX_AFIO('B', 14, GPIO_IN, NORMP)
#define I2S1_ADD_SD_PB14_OUT \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, NORMP)
#define I2S1_ADD_SD_PC2_INP \
	GD32_PINMUX_AFIO('C', 2, GPIO_IN, NORMP)
#define I2S1_ADD_SD_PC2_OUT \
	GD32_PINMUX_AFIO('C', 2, ALTERNATE, NORMP)

/* I2S1_CK */
#define I2S1_CK_PB13_INP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, NORMP)
#define I2S1_CK_PB13_OUT \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* I2S1_MCK */
#define I2S1_MCK_PC6 \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)

/* I2S1_SD */
#define I2S1_SD_PB15_INP \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
#define I2S1_SD_PB15_OUT \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* I2S1_WS */
#define I2S1_WS_PB12_INP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)
#define I2S1_WS_PB12_OUT \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2S2_ADD_SD */
#define I2S2_ADD_SD_PB4_INP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, NORMP)
#define I2S2_ADD_SD_PB4_OUT \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)
#define I2S2_ADD_SD_PC11_INP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, NORMP)
#define I2S2_ADD_SD_PC11_OUT \
	GD32_PINMUX_AFIO('C', 11, ALTERNATE, NORMP)

/* I2S2_CK */
#define I2S2_CK_PB3_INP_NORMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, I2S2_NORMP)
#define I2S2_CK_PB3_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, I2S2_NORMP)
#define I2S2_CK_PC10_INP_RMP \
	GD32_PINMUX_AFIO('C', 10, GPIO_IN, I2S2_RMP)
#define I2S2_CK_PC10_OUT_RMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, I2S2_RMP)

/* I2S2_MCK */
#define I2S2_MCK_PC7 \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, NORMP)

/* I2S2_SD */
#define I2S2_SD_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, I2S2_NORMP)
#define I2S2_SD_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, I2S2_NORMP)
#define I2S2_SD_PC12_INP_RMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, I2S2_RMP)
#define I2S2_SD_PC12_OUT_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, I2S2_RMP)

/* I2S2_WS */
#define I2S2_WS_PA15_INP_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, I2S2_NORMP)
#define I2S2_WS_PA15_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, I2S2_NORMP)
#define I2S2_WS_PA4_INP_RMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, I2S2_RMP)
#define I2S2_WS_PA4_OUT_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, I2S2_RMP)

/* OSC32IN */
#define OSC32IN_PC14 \
	GD32_PINMUX_AFIO('C', 14, GPIO_IN, NORMP)

/* OSC32OUT */
#define OSC32OUT_PC15 \
	GD32_PINMUX_AFIO('C', 15, ALTERNATE, NORMP)

/* SHRTIMER_EXEV0 */
#define SHRTIMER_EXEV0_PC12 \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, NORMP)

/* SHRTIMER_EXEV1 */
#define SHRTIMER_EXEV1_PC11 \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, NORMP)

/* SHRTIMER_EXEV2 */
#define SHRTIMER_EXEV2_PB7 \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, NORMP)
#define SHRTIMER_EXEV2_PD5 \
	GD32_PINMUX_AFIO('D', 5, GPIO_IN, NORMP)

/* SHRTIMER_EXEV3 */
#define SHRTIMER_EXEV3_PB6 \
	GD32_PINMUX_AFIO('B', 6, GPIO_IN, NORMP)
#define SHRTIMER_EXEV3_PG11 \
	GD32_PINMUX_AFIO('G', 11, GPIO_IN, NORMP)

/* SHRTIMER_EXEV4 */
#define SHRTIMER_EXEV4_PB9 \
	GD32_PINMUX_AFIO('B', 9, GPIO_IN, NORMP)
#define SHRTIMER_EXEV4_PG12 \
	GD32_PINMUX_AFIO('G', 12, GPIO_IN, NORMP)

/* SHRTIMER_EXEV5 */
#define SHRTIMER_EXEV5_PB5 \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, NORMP)

/* SHRTIMER_EXEV6 */
#define SHRTIMER_EXEV6_PB4 \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, NORMP)

