noobwang233/hal_gigadevice/include/dt-bindings/pinctrl/gd32e503z(e-c)xx-pinctrl.h
/* SQPI_CLK */
#define SQPI_CLK_PF8 \
	GD32_PINMUX_AFIO('F', 8, ALTERNATE, NORMP)

/* SQPI_CSN */
#define SQPI_CSN_PF6 \
	GD32_PINMUX_AFIO('F', 6, ALTERNATE, NORMP)
#define SQPI_CSN_PG4 \
	GD32_PINMUX_AFIO('G', 4, ALTERNATE, NORMP)

/* SQPI_D0 */
#define SQPI_D0_PF0 \
	GD32_PINMUX_AFIO('F', 0, ALTERNATE, NORMP)

/* SQPI_D1 */
#define SQPI_D1_PF4 \
	GD32_PINMUX_AFIO('F', 4, ALTERNATE, NORMP)
#define SQPI_D1_PG6 \
	GD32_PINMUX_AFIO('G', 6, ALTERNATE, NORMP)

/* SQPI_D2 */
#define SQPI_D2_PF2 \
	GD32_PINMUX_AFIO('F', 2, ALTERNATE, NORMP)
#define SQPI_D2_PG8 \
	GD32_PINMUX_AFIO('G', 8, ALTERNATE, NORMP)

/* SQPI_D3 */
#define SQPI_D3_PF10 \
	GD32_PINMUX_AFIO('F', 10, ALTERNATE, NORMP)

/* TAMPER_RTC */
#define TAMPER_RTC_PC13 \
	GD32_PINMUX_AFIO('C', 13, GPIO_IN, NORMP)

/* TIMER0_BRKIN */
#define TIMER0_BRKIN_PB12 \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8_INP_NORMP \
	GD32_PINMUX_AFIO('A', 8, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH0_PA8_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_PA8_INP_PRMP \
	GD32_PINMUX_AFIO('A', 8, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH0_PA8_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH0_PE9_INP_FRMP \
	GD32_PINMUX_AFIO('E', 9, GPIO_IN, TIMER0_FRMP)
#define TIMER0_CH0_PE9_OUT_FRMP \
	GD32_PINMUX_AFIO('E', 9, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH0_ON */
#define TIMER0_CH0_ON_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_ON_PA7_PRMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH0_ON_PE8_FRMP \
	GD32_PINMUX_AFIO('E', 8, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9_INP_NORMP \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH1_PA9_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_PA9_INP_PRMP \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH1_PA9_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH1_PE11_INP_FRMP \
	GD32_PINMUX_AFIO('E', 11, GPIO_IN, TIMER0_FRMP)
#define TIMER0_CH1_PE11_OUT_FRMP \
	GD32_PINMUX_AFIO('E', 11, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH1_ON */
#define TIMER0_CH1_ON_PB14_NORMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_ON_PB0_PRMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH1_ON_PE10_FRMP \
	GD32_PINMUX_AFIO('E', 10, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10_INP_NORMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH2_PA10_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_PA10_INP_PRMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH2_PA10_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH2_PE13_INP_FRMP \
	GD32_PINMUX_AFIO('E', 13, GPIO_IN, TIMER0_FRMP)
#define TIMER0_CH2_PE13_OUT_FRMP \
	GD32_PINMUX_AFIO('E', 13, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH2_ON */
#define TIMER0_CH2_ON_PB15_NORMP \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_ON_PB1_PRMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH2_ON_PE12_FRMP \
	GD32_PINMUX_AFIO('E', 12, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11_INP_NORMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH3_PA11_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH3_PA11_INP_PRMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH3_PA11_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH3_PE14_INP_FRMP \
	GD32_PINMUX_AFIO('E', 14, GPIO_IN, TIMER0_FRMP)
#define TIMER0_CH3_PE14_OUT_FRMP \
	GD32_PINMUX_AFIO('E', 14, ALTERNATE, TIMER0_FRMP)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12_NORMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_NORMP)
#define TIMER0_ETI_PA12_PRMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_PRMP)
#define TIMER0_ETI_PE7_FRMP \
	GD32_PINMUX_AFIO('E', 7, GPIO_IN, TIMER0_FRMP)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0_INP_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH0_PA0_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH0_PA0_INP_PRMP2 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH0_PA0_OUT_PRMP2 \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH0_PA15_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH0_PA15_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH0_PA15_INP_FRMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH0_PA15_OUT_FRMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1_INP_NORMP \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH1_PA1_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH1_PA1_INP_PRMP2 \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH1_PA1_OUT_PRMP2 \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH1_PB3_INP_PRMP1 \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH1_PB3_OUT_PRMP1 \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH1_PB3_INP_FRMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH1_PB3_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2_INP_NORMP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH2_PA2_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH2_PA2_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH2_PA2_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH2_PB10_INP_PRMP2 \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH2_PB10_OUT_PRMP2 \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH2_PB10_INP_FRMP \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH2_PB10_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3_INP_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH3_PA3_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH3_PA3_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH3_PA3_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH3_PB11_INP_PRMP2 \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH3_PB11_OUT_PRMP2 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH3_PB11_INP_FRMP \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH3_PB11_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, TIMER1_FRMP)

/* TIMER1_ETI */
#define TIMER1_ETI_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_NORMP)
#define TIMER1_ETI_PA0_PRMP2 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_ETI_PA15_PRMP1 \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_ETI_PA15_FRMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_FRMP)

